Object.assign(window.gameData, { GameDialogDialogs: {
  "partTimeJob_sawmill_onduty": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "clothes"},
        {id: -1, text: "Всего хорошего"}
      ]
    },
    "clothes": {
      speaker: "Менеджер",
      text: "Иди сначала переоденься",
      options: [
        {id: -1, text: "Всего хорошего"}
      ]
    }
  },
  "partTimeJob_sawmill_free": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "vacancies"},
        {id: -1, text: "Нет, спасибо"}
      ]
    },
    "vacancies": {
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: "woodworker", text: "Вакансия обработчика дерева", next: "confirm"},
        {id: "lumberjack", text: "Вакансия лесоруб", next: "confirm"},
        {id: -1, text: "Кажется, я передумал", next: "0"}
      ]
    },
    "confirm": {
      speaker: "Менеджер",
      text: "Вот и славно! А теперь, иди переоденься и можешь приступать",
      options: [
        {id: -1, text: "Всего хорошего"},
      ]
    },
  },
  "partTimeJob_construction_onduty": {
    "0": {
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "clothes"},
        {id: -1, text: "Всего хорошего"}
      ]
    },
    "clothes": {
      speaker: "Менеджер",
      text: "Иди сначала переоденься",
      options: [
        {id: -1, text: "Всего хорошего"}
      ]
    }
  },
  "partTimeJob_construction_free": {
    "0": {
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "vacancies"},
        {id: -1, text: "Нет, спасибо"}
      ]
    },
    "vacancies": {
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: "handyman", text: "Вакансия разнорабочего", next: "confirm"},
        {id: "electrician", text: "Вакансия электрика", next: "confirm"},
        {id: "welder", text: "Вакансия сварщика", next: "confirm"},
        {id: "finishing", text: "Вакансия отделочника", next: "confirm"},
        {id: "driver", text: "Вакансия водителя", next: "confirm"},
        {id: -1, text: "Кажется, я передумал", next: "0"}
      ]
    },
    "confirm": {
      speaker: "Менеджер",
      text: "Вот и славно! А теперь, иди переоденься и можешь приступать",
      options: [
        {id: -1, text: "Всего хорошего"}
      ]
    },
  },
  "partTimeJob_port_onduty": {
    "0": {
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "clothes"},
        {id: -1, text: "Всего хорошего"}
      ]
    },
    "clothes": {
      speaker: "Менеджер",
      text: "Иди сначала переоденься",
      options: [
        {id: -1, text: "Всего хорошего"}
      ]
    }
  },
  "partTimeJob_port_free": {
    "0": {
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "vacancies"},
        {id: -1, text: "Нет, спасибо"}
      ]
    },
    "vacancies": {
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: "loader", text: "Вакансия грузчика", next: "confirm"},
        {id: "forklift", text: "Вакансия водителя вилочного погрузчика", next: "confirm"},
        {id: "handler", text: "Вакансия водителя погрузчика контейнеров", next: "confirm"},
        {id: -1, text: "Кажется, я передумал", next: "0"}
      ]
    },
    "confirm": {
      speaker: "Менеджер",
      text: "Вот и славно! А теперь, иди переоденься и можешь приступать",
      options: [
        {id: "end", text: "Всего хорошего"}
      ]
    },
  },
  "partTimeJob_oilRig_onduty": {
    "0": {
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "clothes"},
        {id: -1, text: "Всего хорошего"}
      ]
    },
    "clothes": {
      speaker: "Менеджер",
      text: "Иди сначала переоденься",
      options: [
        {id: -1, text: "Всего хорошего"}
      ]
    }
  },
  "partTimeJob_oilRig_free": {
    "0": {
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "vacancies"},
        {id: -1, text: "Нет, спасибо"}
      ]
    },
    "vacancies": {
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: "adjuster", text: "Вакансия мастера регулировщика", next: "confirm"},
        {id: "cleaner", text: "Вакансия обслуживаюшего персонала", next: "confirm"},
        {id: "diver", text: "Вакансия водолаза", next: "confirm"},
        {id: -1, text: "Кажется, я передумал", next: "0"}
      ]
    },
    "confirm": {
      speaker: "Менеджер",
      text: "Вот и славно! А теперь, иди переоденься и можешь приступать",
      options: [
        {id: -1, text: "Всего хорошего"}
      ]
    },
  },
  "partTimeJob_logisticCompanyDriver_isWorker": {
    "0": {
      speaker: "Менеджер",
      text: "Хватит лениться, давай быстрее прыгай за руль и начинай работать, не забудь переодеться!",
      options: [
        {id: 1, text: "Я пойду, всего хорошего!"}
      ]
    },
  },
  "partTimeJob_logisticCompanyDriver_free": {
    "0": {
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "vacancies"},
        {id: -1, text: "Нет, спасибо"}
      ]
    },
    "vacancies": {
      speaker: "Менеджер",
      text: "Ну смотри, у нас вакансия сейчас всего лишь одна:",
      options: [
        {id: "driver", text: "Вакансия водителя", next: "confirm"},
        {id: -1, text: "Кажется, я передумал"}
      ]
    },
    "confirm": {
      speaker: "Менеджер",
      text: "Вот и славно! А теперь, иди переоденься и можешь приступать",
      options: [
        {id: -1, text: "Хорошо, сейчас все сделаю!"}
      ]
    },
  },
  "partTimeJob_carfactory_onduty": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "clothes"},
        {id: -1, text: "Всего хорошего"}
      ]
    },
    "clothes": {
      speaker: "Менеджер",
      text: "Иди сначала переоденься",
      options: [
        {id: -1, text: "Всего хорошего"}
      ]
    }
  },
  "partTimeJob_carfactory_free": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "vacancies"},
        {id: -1, text: "Нет, спасибо"}
      ]
    },
    "vacancies": {
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: "carassembler", text: "Вакансия сборщика автомобилей", next: "confirm"},
        {id: -1, text: "Кажется, я передумал"}
      ]
    },
    "confirm": {
      speaker: "Менеджер",
      text: "Вот и славно! А теперь, иди переоденься и можешь приступать. Раздевалка находится в основном помещении, там будет лестница на второй этаж, поднимешься и найдешь там раздевалку. Давай в темпе!",
      options: [
        {id: -1, text: "Хорошо, я понял, спасибо"}
      ]
    },
  },


  "partTimeJob_garbageman_onduty": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Менеджер",
      text: "Че ты хочешь от меня? Иди сначала переоденься, потом поговорим, несет от тебя запашком конечно...",
      options: [
        {id: -1, text: "Понял, скоро вернусь"}
      ]
    },
  },
  "partTimeJob_garbageman_free": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Менеджер",
      text: "Кхе-кхе.. Привет, интересуешься подработкой? Спрашивай, только быстрее!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "vacancies"},
        {id: -1, text: "Нет, спасибо"}
      ]
    },
    "vacancies": {
      speaker: "Менеджер",
      text: "Работы у нас не так много, как ты понимаешь, поэтому я тебе могу предложить только следующее:",
      options: [
        {id: "garbageman", text: "Вакансия водителя мусоровоза", next: "confirm"},
        {id: -1, text: "Кажется, я передумал"}
      ]
    },
    "confirm": {
      speaker: "Менеджер",
      text: "Вот и славно! А теперь, иди переоденься и можешь приступать. Давай в темпе, у нас не любят лентяев.",
      options: [
        {id: -1, text: "Хорошо, я понял, спасибо"}
      ]
    },
  },

  "partTimeJob_taxidriver_onduty": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "alreadyWorking"},
        {id: -1, text: "Я передумал, всего хорошего"}
      ]
    },
    "alreadyWorking": {
      speaker: "Менеджер",
      text: "Ты уже у нас работаешь, посмотри в свой телефон, мы установили тебе туда приложения водителя такси!",
      options: [
        {id: -1, text: "Понял, сейчас посмотрю, всего хорошего"}
      ]
    }
  },
  "partTimeJob_taxidriver_free": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Менеджер",
      text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "vacancies"},
        {id: -1, text: "Нет, спасибо"}
      ]
    },
    "vacancies": {
      speaker: "Менеджер",
      text: "Ну слушай, работы у нас не особо много, вот все то, что я могу тебе предложить:",
      options: [
        {id: "taxidriver", text: "Вакансия водителя такси", next: "confirm"},
        {id: -1, text: "Кажется, я передумал"}
      ]
    },
    "confirm": {
      speaker: "Менеджер",
      text: "Вот и славно! Я отправил тебе приложение водителя такси в твой телефон, проверь и убедись, что все работает, после этого приступай к работе!",
      options: [
        {id: -1, text: "Хорошо, я понял, спасибо"}
      ]
    },
  },

  "partTimeJob_onAnotherDuty": {
    "0": {
      speaker: "Менеджер",
      text: "Насколько мне известно ты уже где-то работаешь, если хочешь работать со мной - заканчивай работу и приезжай!",
      options: [
        {id: -1, text: "Понял, всего хорошего"}
      ]
    },
  },

  "licensingCenter_helper": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Тим: Консультант",
      text: "Здравствуйте! Меня зовут Тим, я консультант в этом центре лицензирования! Я могу проконсультировать Вас по любым вопросам.",
      options: [
        {id: "driverLicense", text: "Здравствуйте, где я могу получить водительские права?", next: "driver_card"},
        {id: "licenseSeller", text: "Здравствуйте, я хочу приобрести лицензию", next: "seller"},
        {id: -1, text: "Нет, спасибо, я сам(-а) разберусь"}
      ]
    },
    "driver_card": {
      speaker: "Тим: Консультант",
      text: "По левую руку от меня, в сером костюме, стоит главный лицензер в лицензиях типа: B, он Вам с удовольствием расскажет о том, как получить лицензию для вождения автомобиля!",
      options: [
        {id: "question", text: "Хорошо, можно задать еще один вопрос?", next: "0"},
        {id: -1, text: "Хорошо, я понял, спасибо"}
      ]
    },
    "seller": {
      speaker: "Тим: Консультант",
      text: "Напротив этой стойки стоит мужчина в фиолетовой рубашке, он Вам окажет любую консультацию в сфере лицензий, исключая категорию B, которая для вождения автомобилей.",
      options: [
        {id: "question", text: "Хорошо, можно задать еще один вопрос?", next: "0"},
        {id: -1, text: "Хорошо, я понял, спасибо"}
      ]
    },
  },

  "licensingCenter_driverLicenser": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Марк: Главный лицензер категории \"B\"",
      text: "Здравствуйте! Меня зовут Марк, я являюсь лицензером категории В, чем могу быть Вам полезен?",
      options: [
        {id: 1, text: "Здравствуйте, я хочу получить водительские права, как я могу это сделать?", next: "driver_card"},
        {id: -1, text: "Нет, спасибо, ничего не надо, я разберусь"}
      ]
    },
    "driver_card": {
      speaker: "Марк: Главный лицензер категории \"B\"",
      text: "Хорошо, для получения водительских прав у нас есть следующая система: сдача теоретического экзамена, затем практического. Чтобы легче было пройти теоретическую часть экзамена, я Вам советую ознакомиться со всем правилами, в левом и правом кабинетах. Сдача экзамена - в центральном, который за лестницей. Стоит Вас уведомить о том, что это все обойдет в 100$, Вы согласны?",
      options: [
        {id: "agree", text: "Я согласен, хочу прямо сейчас начать теоретический экзамен!", next: "agreed"},
        {id: -1, text: "Я пойду пока что изучу все правила"}
      ]
    },
    "agreed": {
      speaker: "Марк: Главный лицензер категории \"B\"",
      text: "Отлично! Тогда пройдите в центральный кабинет, который находится прямо за лестницей, подойдите в любому свободному столу и сдайте теоретическую часть!",
      options: [
        {id: "startMission", text: "Хорошо, я понял, спасибо"}
      ]
    },
  },

  "licensingCenter_driverLicenser_gettingLicense": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Марк: Главный лицензер категории \"B\"",
      text: "Хорошая работа, Вы хорошо справились с практическим экзаменом и получаете свои права, вот, держите!",
      options: [
        {id: "get", text: "Взять лицензию на вождение", next: "end"}
      ]
    },
    "end": {
      speaker: "Марк: Главный лицензер категории \"B\"",
      text: "Ну в таком случае всего Вам хорошего!",
      options: [
        {id: -1, text: "Спасибо за экзамен, до свидания!"}
      ]
    },
  },

  "licensingCenter_driverLicenser_isOnExam": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Марк: Главный лицензер категории \"B\"",
      text: "Хм.. Вы уже начали процедуру по получению удостоверения водителя! Мне больше нечего Вам сказать.",
      options: [
        {id: -1, text: "Хорошо, я понял(-а)"}
      ]
    },
  },

  "licensingCenter_LensesSeller": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Энтони: Продавец лицензий",
      text: "Здравствуйте! Меня зовут Энтони, я занимаюсь продажей лицензий всех типов, исключая \"B\" и лицензию на оружие, чем могу быть Вам полезен?",
      options: [
        {id: 1, text: "Здравствуйте, я хочу ознакомиться с ценами на лицензии", next: "prices"},
        {id: -1, text: "Нет, спасибо, ничего не надо"}
      ]
    },
    "prices": {
      speaker: "Энтони: Продавец лицензий",
      text: "Хорошо, не вопрос, вот держите листочек, на нем написаны цены на все виды имеющихся у меня лицензий, скажите, если захотите что-то приобрести.",
      options: [
        {id: "cargo", text: "Я хочу купить лицензию на управление “Грузовым транспортом” - 5.000$", next: "confirm"},
        {id: "moto", text: "Я хочу купить лицензию на управление “Мото-техникой” - 8.000$", next: "confirm"},
        {id: "water", text: "Я хочу купить лицензию на управление “Водным судном” - 12.000$", next: "confirm"},
        {id: "aerial", text: "Я хочу купить лицензию на управление “Воздушным судном” - 15.000$", next: "confirm"},
        {id: -1, text: "Я передумал(-а), спасибо"}
      ]
    },
    "confirm": {
      speaker: "Энтони: Продавец лицензий",
      text: "С вами приятно иметь дело, держите Вашу лицензию!",
      options: [
        {id: -1, text: "Хорошо, спасибо, всего хорошего"}
      ]
    },
  },

  "vehicleRent_landlord": {
    "0": {
      speaker: "Арендодатель",
      text: "Здравствуйте! Наша компания занимается сдачей транспортных средств в аренду! Желаете что-то арендовать?",
      options: [
        {id: "vehicleList", text: "Здравствуйте, я хочу ознакомиться с ценами на аренду", next: "prices"},
        {id: -1, text: "Нет, спасибо, ничего не надо"}
      ]
    },
    "prices": {
      speaker: "Арендодатель",
      text: "Хорошо, не вопрос, вот держите бланк со всеми ценами на транспорт!\n\n(( Используйте интерфейс, после выход из диалога ))",
      options: [
        {id: "showRent", text: "Хорошо, понял"}
      ]
    },
  },

  "carlos_startMission": {
    "0": {
      speaker: "Карлос",
      text: "Привет, моё имя - Карлос! Ааа… Черт. Кажется у меня что то с телефоном. Эмм… Ты какой то растерянный! Впервые у нас?",
      options: [
        {id: "firstTime", text: "Да, я у вас впервые.", next: "yes"},
        {id: -1, text: "Нет, я уже бывалый."}
      ]
    },
    "yes": {
      speaker: "Карлос",
      text: "Отлично! Я думаю тебе здесь понравится. Мой брат Ральф работает неподалеку отсюда. Он занимается арендой транспорта. Я брал у него скутер, и теперь мне нужно вернуть его. Мой чертов телефон почему то не ловит связь, мне нужно срочно сгонять в сервис, так как я жду очень важный звонок. Ты поможешь мне, а я замолвлю за тебя словечко перед моим братишкой. Координаты места сдачи скутера, будут забиты в твоем GPS. Забери скутер, он стоит вон там.",
      options: [
        {id: "startMission", text: "Отлично, я готов."},
        {id: -1, text: "Как нибудь сам справлюсь!"}
      ]
    },
  },

  "carlos_noQuest": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Карлос",
      text: "Мне сейчас не о чем с тобой разговаривать, иди лучше делами займись, а не шастай тут туда-сюда!",
      options: [
        {id: -1, text: "Хорошо, я понял"},
        {id: -1, text: "Да пошел ты к черту!"}
      ]
    },
  },

  "ralph_firstQuest": {
    "0": {
      speaker: "Ральф",
      text: "Эй, иди сюда? Только что, мой младший брат Карлос прислал смс мне. Ты должен был доставить арендованный им скутер. Спасибо тебе! Я думал что уже попрощался с этим скутером. Этот братец…  Вот, держи купон со скидкой. Купон действует 24 часа после первой аренды. Если есть лицензии, по мимо скутеров, можешь брать и другой транспорт. Арендовать можешь любой понравившейся транспорт.",
      options: [
        {id: "thanks", text: "Спасибо", next: "offer"},
        {id: -1, text: "Нет, я уже бывалый."}
      ]
    },
    "offer": {
      speaker: "Ральф",
      text: "У меня есть хорошее предложение для тебя. Вижу ты смышленый(-ая). Работа не пыльная, да и подзаработать можешь!",
      options: [
        {id: "next", text: "Что нужно делать?", next: "offer2"},
        {id: -1, text: "Как нибудь сам справлюсь!"}
      ]
    },
    "offer2": {
      speaker: "Ральф",
      text: "У нашей компании подписаны определенные договоренности с одной крупной шишкой из местного правительства. И только сейчас этот придурок, позвонил мне что-бы я приехал и забрал подписанный контракт для дальнейшего сотрудничества. Но этот хрен не учел, что по таким вещам, нужно предупреждать заранее. Я кое что принял пару часов назад, и не могу явится в таком состоянии. Думаю мы понимаем друг друга. Выручишь меня? А я тебя отблагодарю. Кстати можешь воспользоваться полученным купоном на скутер.",
      options: [
        {id: "accept", text: "Не вопрос, помогу" },
        {id: -1, text: "Нет, сейчас не могу, у меня дела!" }
      ]
    },
  },

  "ralph_rentScooter": {
    "0": {
      speaker: "Ральф",
      text: "Хочешь воспользоваться своим купоном?",
      options: [
        {id: "yes", text: "Да", next: "yes"},
        {id: -1, text: "Нет, спасибо"}
      ]
    },
    "yes": {
      speaker: "Ральф",
      text: "Хорошо, держи ключи от твоего скутера, он ждет тебя на парковке, удачи!",
      options: [
        {id: "thanks", text: "Хорошо, спасибо!"}
      ]
    }
  },

  "manager_documents": {
    "0": {
      speaker: "Менеджер",
      text: "Здравствуйте! Меня зовут Стивен. Чем я могу вам помочь?",
      options: [
        {id: 1, text: "Я от Ральфа по поводу контракта.", next: "contract"},
        {id: -1, text: "Нет, всего хорошего"}
      ]
    },
    "contract": {
      speaker: "Менеджер: Стивен",
      text: "Что-то да припоминаю. А, это тот странный парень что держит местную контору по аренде транспорт. Ну, и зачем он тебя прислал?",
      options: [
        {id: 2, text: "Мне нужны подписанные контракты на его контору.", next: "documents"}
      ]
    },
    "documents": {
      speaker: "Менеджер: Стивен",
      text: "Хмм… А почему он сам не изволил приехать за контрактом своей компании? Да и выглядите вы слишком подозрительно. Я не могу передать вам контракт, просто поверив на слово. Пожалуйста, покажите ваши документы для удостоверения вашей личности!",
      options: [
        {id: 3, text: "К сожалению я здесь недавно, и не успел получить новые документы", next: "noDocs"}
      ]
    },
    "noDocs": {
      speaker: "Менеджер: Стивен",
      text: "Тогда извини парень. Наш орган не выдает документы первым попавшимся лицам, заявившим о себе что они чьи то посредники. Если хочешь получить от меня документы, то пожалуйста достань и предоставь мне свои документы. К слову, наша организация может тебе помочь с этим вопросом.",
      options: [
        {id: "startMission", text: "Спасибо, буду иметь ввиду."}
      ]
    }
  },

  "manager2_getDocuments": {
    "0": {
      speaker: "Паспортный стол: Менеджер",
      text: "Здравствуйте! Меня зовут Ариана. Чем могу вам помочь?",
      options: [
        {id: 1, text: "Здравствуйте, мне бы хотелось восстановить свой паспорт, как я могу это сделать?", next: "pasport"},
        {id: -1, text: "Ничего, всего хорошего"}
      ]
    },
    "pasport": {
      speaker: "Паспортный стол: Ариана",
      text: "Представьтесь и скажите в каких условиях вы потеряли свои документы",
      options: [
        {id: 2, text: "Представиться и рассказать все необходимое", next: "getDocuments"},
        {id: -1, text: "Нет, спасибо"},
      ]
    },
    "getDocuments": {
      speaker: "Паспортный стол: Ариана",
      text: "Хорошо, я поняла, ваши документы будут готовы примерно через 10-20 минут, ожидайте!",
      options: [
        {id: "startMission", text: "Хорошо, большое спасибо!"}
      ]
    }
  },

  "henry_helpDialog": {
    "0": {
      speaker: "Генри",
      text: "Привет. Меня зовут Генри и я один из продавцов этого замечательного магазина! Сейчас за кассой стоит мой коллега Чарли, а я вышел покурить. Заходи, не стесняйся! Чарли очень гостеприимный.",
      options: [
        {id: 1, text: "Привет! Хороший у вас магазинчик.", next: "store"},
        {id: -1, text: "Всего доброго."}
      ]
    },
    "store": {
      speaker: "Генри",
      text: "Я работаю в этом месте уже 20 лет, и сегодня, в свой день рождения, мне назначили рабочую смену!",
      options: [
        {id: 2, text: "С праздником вас. Я вижу вы не довольны. У вас что то случилось?", next: "what"},
        {id: -1, text: "Отлично, но мне это не интересно."}
      ]
    },
    "what": {
      speaker: "Генри",
      text: "Моя племянница Сьюзи, сейчас находится в больнице. Вот, вот ее должны выписать, и я хотел сделать для нее подарок, но не смог из за своей смены. Как же мне стыдно, а я ведь обещал ей, что приеду.",
      options: [
        {id: 3, text: "Мне очень жаль. Может быть я могу вам чем то помочь?", next: "help"},
        {id: -1, text: "Не повезло конечно. Удачи!"}
      ]
    },
    "help": {
      speaker: "Генри",
      text: "Я буду очень благодарен, если ты сделаешь это! Мне очень важно, что-бы она получила подарок. Спасибо тебе.",
      options: [
        {id: "startMission", text: "Не волнуйтесь. Я доставлю подарок"},
      ]
    }
  },

    "susie_helpDialog": {
    "0": {
      speaker: "Сьюзи",
      text: "Привет. Дядюшка Генри позвонил мне, и предупредил что ты привезешь что-то, что мне должно очень понравится.",
      options: [
        {id: 1, text: "Да, конечно. Держи это от твоего дяди.", next: "thanks"}
      ]
    },
    "thanks": {
      speaker: "Сьюзи",
      text: "Я очень ждала этот подарок! Спасибо тебе что помог моему дядюшки, я тебе очень благодарна.",
      options: [
        {id: 2, text: "Не благодари! Передавай привет Генри.", next: "bye"}
      ]
    },
    "bye": {
      speaker: "Сьюзи",
      text: "Да, конечно! Обязательно передам.",
      options: [
        {id: "bye", text: "Еще увидимся, пока!"}
      ]
    }
  },

  "manager2_getDocuments2": {
    "0": {
      speaker: "Паспортный стол: Менеджер",
      text: "Снова здравствуйте! Вы как раз очень во-время, ваши документы уже готовы!",
      options: [
        {id: 1, text: "Отлично, я могу их прямо тут получить?", next: "passport"}
      ]
    },
    "passport": {
      speaker: "Паспортный стол: Ариана",
      text: "Да, конечно, вот, держите!",
      options: [
        {id: "getDocuments", text: "Взять документы и попрощаться."}
      ]
    }
  },

  "manager_getContracts": {
    "0": {
      speaker: "Менеджер: Стивен",
      text: "А, это ты? Ну что уже получил документы? Давай показывай",
      options: [
        {id: 1, text: "Показать документы Стивену.", next: "show"},
        {id: -1, text: "Я еще не закончил."}
      ]
    },
    "show": {
      speaker: "Менеджер: Стивен",
      text: "Так… Что тут у нас. Ага, понятно. Ну теперь я могу тебе доверять, ведь в случае чего, я найду тебя и… Думаю мы понимаем друг друга",
      options: [
        {id: 2, text: "Ты че, меня напугать хочешь?", next: "get"}
      ]
    },
    "get": {
      speaker: "Менеджер: Стивен",
      text: "Нет, я тебя просто предупреждаю, что-бы был в курсе, с кем имеешь дело.",
      options: [
        {id: "nextMission", text: "Я тебя услышал."},
        {id: "nextMission", text: "Да иди ты нахрен!"}
      ]
    }
  },

  "ralph_takeContracts": {
    "0": {
      speaker: "Ральф",
      text: "Ты уже вернулся? Ну как все прошло?",
      options: [
        {id: "give", text: "Вот держи, он передал мне твой контракт.", next: "give"}
      ]
    },
    "give": {
      speaker: "Ральф",
      text: "Вау, да ты нашел диалог с этим говнюком! Если честно, он мне не по душе.",
      options: [
        {id: 2, text: "Мне тоже.", next: "rent"},
        {id: 3, text: "Все нормально, я с ним поговорил и поставил его на место.", next: "rent"}
      ]
    },
    "rent": {
      speaker: "Ральф",
      text: "По городу есть много моих хороших знакомых, парни занимаются сдачей различного рода транспорта, в GPS они обозначены зеленой машин с рулем, дерзай! Вот тебе деньги, арендуй любую машину, покатайся по городу. К слову, не забудь купить себе телефон, это очень важно! Я сам тебя найду как будет работа.",
      options: [
        {id: "startMission", text: "Хорошо, спасибо."}
      ]
    }
  },

  "ralph_friend": {
    "0": {
      speaker: "Ральф",
      text: "Я смотрю ты уже освоился. У меня есть номер одной красотки. Тебе нужно с ней познакомится. Если бы у меня не было жены, я бы и сам не прочь с ней потусить. Это подруга моей жены. В общем эта девчонка владеет местным стрип-клубом в Лос-Сантосе. Чика что надо. Я познакомлю тебя с ней, но для начала тебе нужно привести себя в порядок, а то видок у тебя не очень…",
      options: [
        {id: 1, text: "Как раз сейчас расслабится с хорошей девочкой не помешало.", next: "yes"},
        {id: -1, text: "Меня не интересуют новые знакомства."}
      ]
    },
    "yes": {
      speaker: "Ральф",
      text: "Для начала тебе нужно привести свою стрижку в порядок, а то выглядишь ты как хипстер ха-ха-ха. Так… Что у нас по одежде? Да… Дело дрянь. Одежду тоже тебе сменить не помешало бы. На все это, можешь одолжить у меня тачку в аренду. В этот раз плачу я, но в следующий раз, за тобой останется должок ха-ха-ха.",
      options: [
        {id: "end", text: "Отлично! Спасибо тебе, я поехал."},
        {id: -1, text: "Спасибо в другой раз."}
      ]
    }
  },

  "susie_club": {
    "0": {
      speaker: "Сьюзи",
      text: "Это ты? Да… Конечно очень неожиданная встреча для меня. Хочу поблагодарить тебя еще раз за тот подарок что ты принес мне хи-хи. Я немного пьяна, и хочу где-то развеяться. Может куда нибудь съездить?",
      options: [
        {id: 1, text: "Неожиданная встреча! Как твое здоровье?", next: "how"},
        {id: -1, text: "Кажется мы не знакомы."}
      ]
    },
    "how": {
      speaker: "Сьюзи",
      text: "Все хорошо, я лежала из за небольшой простуды. Подумала что заразилась вирусом, но тесты показали отрицательный результат. По этому можешь не бояться меня хи-хи. Кстати это мой клуб. Если захочешь развлечься - заходи.",
      options: [
        {id: 2, text: "Ого! Это и вправду твой клуб? Ты очень хорошо выглядишь. Может как-то сходим куда-нибудь?", next: "suggest"},
        {id: -1, text: "Спасибо, в другой раз."}
      ]
    },
    "suggest": {
      speaker: "Сьюзи",
      text: "Я бы посидела в местном и уютном ресторанчике на пляже Санта-Мария. Говорят там очень вкусно готовят. Как раз можем продегустировать местную кухню хи-хи.",
      options: [
        {id: 3, text: "Отлично. Тогда думаю на днях сможем съездить туда.", next: "go"},
        {id: -1, text: "Спасибо, в другой раз."}
      ]
    },
    "go": {
      speaker: "Сьюзи",
      text: "Договорились, хи-хи, увидимся еще.",
      options: [
        {id: "end", text: "Конечно"}
      ]
    }
  },

  "partTimeJob_busDriver_onduty": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Менеджер",
      text: "Че ты хочешь от меня? Иди сначала переоденься, потом поговорим, несет от тебя запашком конечно...",
      options: [
        {id: -1, text: "Понял, скоро вернусь"}
      ]
    },
  },
  "partTimeJob_busDriver_free": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Менеджер",
      text: "Кхе-кхе.. Привет, интересуешься подработкой? Спрашивай, только быстрее!",
      options: [
        {id: 1, text: "Я хочу устроиться на работу", next: "vacancies"},
        {id: -1, text: "Нет, спасибо"}
      ]
    },
    "vacancies": {
      speaker: "Менеджер",
      text: "Работы у нас не так много, как ты понимаешь, поэтому я тебе могу предложить только следующее:",
      options: [
        {id: "busDriver", text: "Вакансия водителя автобуса", next: "confirm"},
        {id: -1, text: "Кажется, я передумал"}
      ]
    },
    "confirm": {
      speaker: "Менеджер",
      text: "Вот и славно! А теперь, иди переоденься и можешь приступать. Давай в темпе, у нас не любят лентяев.",
      options: [
        {id: -1, text: "Хорошо, я понял, спасибо"}
      ]
    },
  },
  "blackMarket_gang": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Хосе",
      text: "Ты обратился по адресу, для своих:\n\nМарихуана - 10 баксов/г Косяк - 50 баксов/шт",
      options: [
        {id: "marijuana", text: "Марихуана", isValueRequired: true, next: "0"},
        {id: "weed", text: "Косяк", isValueRequired: true, next: "0"},
        {id: -1, text: "Уйти"}
      ]
    }
  },
  "blackMarket_gang_noAccess": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Хосе",
      text: "Мне не о чем говорить с тобой, проваливай!",
      options: [
        {id: -1, text: "Уйти"}
      ]
    }
  },
  "blackMarket_mafia": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Баблос",
      text: "Амиго, как обычно самый лучший товар у меня!",
      options: [
        {id: "morphine", text: "Заказать", isValueRequired: true, next: "0"},
        {id: -1, text: "Уйти"}
      ]
    }
  },
  "blackMarket_mafia_noAccess": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Баблос",
      text: "Мне не о чем говорить с тобой, проваливай!",
      options: [
        {id: -1, text: "Уйти"}
      ]
    }
  },
  "blackMarket_mafia_invalidTime": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Баблос",
      text: "Послушай амиго - сейчас не время. Возвращайся в промежутке с 13:00 до 23:00",
      options: [
        {id: -1, text: "Уйти"}
      ]
    }
  },
  "blackMarket_mafia_cooldown": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Баблос",
      text: "Возвращайся завтра амиго! Ты можешь не можешь заказывать чаще чем раз в сутке",
      options: [
        {id: -1, text: "Уйти"}
      ]
    }
  },
  "blackMarket_gangMafia": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Жирный Флорес",
      text: "Ты обратился по адресу, для своих:\n\nГенератор помех - 100$ Отмычки - 100$ Стяжки - 100$ Мешок - 100$",
      options: [
        {id: "jammer", text: "Генератор помех", isValueRequired: true, next: "0"},
        {id: "lockpicks", text: "Отмычки", isValueRequired: true, next: "0"},
        {id: "screeds", text: "Стяжки", isValueRequired: true, next: "0"},
        {id: "bag", text: "Мешок", isValueRequired: true, next: "0"},
        {id: -1, text: "Уйти"}
      ]
    }
  },
  "blackMarket_gangMafia_noAccess": {
    "0": { // TODO Точка входа всегда с индексом 0
      speaker: "Жирный Флорес",
      text: "Мне не о чем говорить с тобой, проваливай!",
      options: [
        {id: -1, text: "Уйти"}
      ]
    }
  },

  "oilRig_diver_clothes1": {
    "0": {
      speaker: "Главный дайвер: Дэйв",
      text: "Привет, хочешь переодеться? Я могу тебе выдавать все необходимой снаряжения для погружения под воду.",
      options: [
        {id: "accept", text: "Привет, да, было-бы неплохо"},
        {id: -1, text: "Меня не интересует это"}
      ]
    }
  },

  "oilRig_diver_clothes2": {
    "0": {
      speaker: "Главный дайвер: Дэйв",
      text: "Ты уже все? Хочешь чтобы я обратно вернул тебе твою одежду?",
      options: [
        {id: "accept", text: "Привет, да, пока что отдохну"},
        {id: -1, text: "Нет, пойду еще поработаю"}
      ]
    }
  },

  "oilRig_pilot_in": {
    "0": {
      speaker: "Пилот: Антонио",
      text: "Кхе-кхе... Ты на вышку собираешься лететь или так и будешь тут стоять?",
      options: [
        {id: "accept", text: "Да, полетели, руки уже чешутся, работать хочу..."},
        {id: -1, text: "Пока что нет"}
      ]
    }
  },

  "oilRig_pilot_out": {
    "0": {
      speaker: "Пилот: Джек",
      text: "Что ты, уже закончил со всей работой, отправляемся назад в порт?",
      options: [
        {id: "accept", text: "Да, полетели"},
        {id: -1, text: "Пока что нет"}
      ]
    }
  },

  "number_plates_vendor": {
    "0": {
      speaker: "Чип",
      text: "Хочешь купить номерной знак на автомобиль?",
      options: [
        {id: "buy", text: "Да, давай"},
        {id: -1, text: "Пока что нет"}
      ]
    }
  },

  "police_warehouse": {
    "0": {
      speaker: "Мэри",
      text: "Привет! Чем тебе помочь? Охранять склад - так скучно...",
      options: [
        {id: "show", text: "Я бы хотел заглянуть на склад"},
        {id: -1, text: "Пока"}
      ]
    }
  },

  "government_supplyManager": {
    "0": {
      speaker: "Руководитель Отдела Поставок",
      text: "Здравствуйте, Вы хотите заказать поставку?",
      options: [
        {id: "armySupply", text: "Заказать поставку на основной склад (NG)", isValueRequired: true},
        {id: "fractionSupply", text: "Заказать поставку для организаций (FIB, LSPD, GOV)", isValueRequired: true},
        {id: -1, text: "Нет, всего хорошего!"}
      ]
    }
  },

  "government_supplyManager_noAccess": {
    "0": {
      speaker: "Руководитель Отдела Поставок",
      text: "Здравствуйте, Вы хотите заказать поставку?",
      options: [
        {id: "armySupply", text: "Заказать поставку на основной склад (NG)", next: "noAccess"},
        {id: "fractionSupply", text: "Заказать поставку для организаций (FIB, LSPD, GOV)", next: "noAccess"},
        {id: -1, text: "Нет, всего хорошего!"}
      ]
    },
    "noAccess": {
      speaker: "Руководитель Отдела Поставок",
      text: "Извините, но вы не можете заказывать поставки. Свяжитесь с кем-то старшим по должности.",
      options: [
        {id: -1, text: "Понял(-а), всего хорошего!"}
      ]
    }
  },
  
  "bankManager_nocard": {
    "0": {
      speaker: "Менеджер",
      text: "Здравствуйте, я менеджер банка. Какой у Вас вопрос?",
      options: [
        {id: "createAccount", text: "Я хотел бы открыть банковский счёт", next: "success"},
        {id: -1, text: "Спасибо, до свидания"}
      ]
    },
    "success": {
      speaker: "Менеджер",
      text: "Отлично! Вы успешно открылы счет",
      options: [
        {id: -1, text: "Спасибо"}
      ]
    }
  },
  
  "bankManager_hascard": {
    "0": {
      speaker: "Менеджер",
      text: "Здравствуйте, я менеджер банка. Какой у Вас вопрос?",
      options: [
        {id: "createAccount", text: "Я хотел бы открыть банковский счёт", next: "no_card"},
        {id: -1, text: "Спасибо, до свидания"}
      ]
    },
    "no_card": {
      speaker: "Менеджер",
      text: "Извините, но у вас уже открыт счет в нашем банке",
      options: [
        {id: -1, text: "Прошу прощения"}
      ]
    }
  }


  // "partTimeJob_sawmill": {
  //   "0": { // TODO Точка входа всегда с индексом 0
  //     speaker: "Менеджер",
  //     text: "Интересуешься подработкой? Ну… Ты прямо по адресу. Спрашивай!",
  //     options: [
  //       {id: 1, text: "Что это за место?", next: "organization"},
  //       {id: 2, text: "Я хочу работать", next: "pickPosition"},
  //       {id: 3, text: "Закончить рабочий день", next: "endWork"},
  //       {id: 4, text: "Моя должность", next: "position"},
  //       {id: -1, text: "Всего хорошего"}
  //     ]
  //   },
  //   "1": {
  //     speaker: "Менеджер",
  //     text: "Так что ты хотел?",
  //     options: [
  //       {id: 1, text: "Что это за место?", next: "organization"},
  //       {id: 2, text: "Я хочу работать", next: "pickPosition"},
  //       {id: 3, text: "Закончить рабочий день", next: "endWork"},
  //       {id: 4, text: "Моя должность", next: "position"},
  //       {id: -1, text: "Всего хорошего"}
  //     ]
  //   },
  //   "organization": {
  //     speaker: "Менеджер",
  //     text: "Наберут дебилов по объявлению... Это Лесопилка",
  //     options: [
  //       {id: 2, text: "Я хочу работать", next: "pickPosition"},
  //       {id: 3, text: "Закончить рабочий день", next: "endWork"},
  //       {id: 4, text: "Моя должность", next: "position"},
  //       {id: -1, text: "Всего хорошего"}
  //     ]
  //   },
  //   "pickPosition": {
  //     speaker: "Менеджер",
  //     text: "На какую должность ты хочешь устроиться?",
  //     options: [
  //       {id: 1, text: "Обработчик", filters: ["sawmill"]},
  //       {id: 2, text: "Лесоруб", filters: ["sawmill"]},

  //       {id: 0, text: "Я хочу уточнить кое-что", next: "1"},
  //       {id: -1, text: "Всего хорошего"}
  //     ]
  //   },
  //   "endWork": {
  //     speaker: "Менеджер",
  //     text: "Уже устал? Ну ты даешь! Твой текущий заработок составляет: $%income%",
  //     options: [
  //       {id: 0, text: "Понятно", next: "1"},
  //       {id: -1, text: "Всего хорошего"}
  //     ]
  //   },
  //   "position": {
  //     speaker: "Менеджер",
  //     text: "Как? Как можно было забыть, что ты %jobPosition%?",
  //     options: [
  //       {id: 1, text: "А что должен делать %jobPosition%?", next: "position_sawmill_wookWorker", filters: ["sawmill_wookWorker"]},
  //       {id: 2, text: "А что должен делать %jobPosition%?", next: "position_sawmill_lumberjack", filters: ["sawmill_lumberjack"]},

  //       {id: 0, text: "Понятно", next: "1"},
  //       {id: -1, text: "Всего хорошего"}
  //     ]
  //   },

  //   "position_sawmill_wookWorker": {
  //     speaker: "Менеджер",
  //     text: "Обработчик - обрабатывает на пилораме необработанную древесину",
  //     options: [
  //       {id: 0, text: "Понятно", next: "1"},
  //       {id: -1, text: "Всего хорошего"}
  //     ]
  //   },
  //   "position_sawmill_lumberjack": {
  //     speaker: "Менеджер",
  //     text: "Лесоруб - занимается распиливанием древесины и ее дальнейшей транспортировкой на склад.",
  //     options: [
  //       {id: 0, text: "Понятно", next: "1"},
  //       {id: -1, text: "Всего хорошего"}
  //     ]
  //   }
  // }
}})
