Object.assign(window.gameData, { GameDialogStrings: {
  test0: "Привет, %name%! Я приятно удивлен, что ты разобрал тех очень плохих парней. Такие как ты встречаются раз в сто лет. Я хотел бы тебе предложить работать на меня, как ты смотришь на это?",
  test1: "Да хоть черту лысому. Работать будешь?",
  test2: "А что ты умеешь?",
  test3: "Ты что в уши долбишься? Я говорю, работа есть - толчки мыть. Пойдешь?",
  test4: "Кличко не твой брат?",
  test5: "А все. Уже не нужно",
  test6: "Я, думаю, это возможно",
  test7: "Извини, но я доверяю только себе"
}})